# IsSeedNode Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DividedSurface..::..IsSeedNode Method
DividedSurface Class See Also
---
Reports whether a grid node is a "seed node," a node that is associated with one or more tiles.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsSeedNode(
	GridNode gridNode
)
```

Visual Basic
---
```text
Public Function IsSeedNode ( _
	gridNode As GridNode _
) As Boolean
```

Visual C++
---
```text
public:
bool IsSeedNode(
	GridNode gridNode
)
```

# ### Parameters
gridNode
    Type: Autodesk.Revit.DB..::..GridNode
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | Thrown when the grid node indexes are outside the range [ 0, NumberOfUGridlines - 1 ], [ 0, NumberOfVGridlines - 1 ]. |

# See Also
DividedSurface Class
Autodesk.Revit.DB Namespace